Tekla.Structures.Internal.ConnectUploads.Connect
Represents the info about the Connect upload.

Tekla.Structures.Internal.ConnectUploads.Connect.Id
Gets or sets the ID of the Connect upload.

Tekla.Structures.Internal.ConnectUploads.Connect.VersionId
Gets or sets the version ID of the Connect upload.

Tekla.Structures.Internal.ConnectUploads.Connect.Location
Gets or sets the location of the Connect upload.

Tekla.Structures.Internal.ConnectUploads.Connect.UploadedBy
Gets or sets the name of the user that uploaded.